const String p1 =
    'من سنن الله تعالى سنّة الأخذ بالأسباب فهى واضحة فى خلق الله هذا الكون بقدرته وأودعه من القوانين والسنن ما يضمن استقراره واستمراره ، وجعل المسببات مرتبطة بالأسباب بعد إرادته تعالى فجعل عرشه سبحانه محمولاً بالملائكة وأرسى الأرض بالجبال وأنبت الزرع بالماء .. وغير ذلك';
const String p2 =
    'إن هؤلاء الكفار لم يبلغوا مابلغوه لأنهم أقرب من الله ، ولم يبلغوا مابلغوا بسحر ولم يقيموا الصناعات أو يخترقوا الفضاء لأن عقيدتهم حق، إنهم بلغوا ذلك لأن سبيل التقدم مفتوح لخلق الله مؤمنهم وكافرهم قال تعالى: مَنْ كَانَ يُرِيدُ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا نُوَفِّ إِلَيْهِمْ أَعْمَالَهُمْ فِيهَا وَهُمْ فِيهَا لاَ يُبْخَسُونَ - سورة هود';
const String p3 =
    'إنها السنة التي أردها الله في هذه الحياة أن جعل التمكين في الحياة يمضي بالجهد البشري، إنها مشيئته وسنته وإرادته صحيح أن هذا التقدم كله لايفتح للكافرين أبواب الجنة ولا يغني عنهم شيئاً ولكن التقصير من جانب المسلم إثم يحاسب عليه.';
const String p4 =
    'قال تعالى: وَالَّذِينَ هَاجَرُوا فِي اللَّهِ مِنْ بَعْدِ مَا ظُلِمُوا لَنُبَوِّئَنَّهُمْ فِي الدُّنْيَا حَسَنَةً وَلأَجْرُ الآخِرَةِ أَكْبَرُ لَوْ كَانُوا يَعْلَمُونَ - سورة النحل';
const String p5 =
    'قال ابن كثير رحمه الله : هذا أمر من الله تعالى لعباده المؤمنين بالهجرة من البلد الذي لا يقدرون فيه على إقامة الدين الى أرض الله الواسعة حتى يمكن إقامة الدين ... الى أن قال: ولهذا ضاق على المستضعفين بمكة مقامهم بها، خرجوا مهاجرين الى أرض الحبشة ليأمنوا على دينهم هناك، فوجدوا خير المنزل هناك أصحمة النجاشي ملك الحبشة رحمه الله تعالى.';
const String p6 =
    'اشتد البلاء على أصحاب رسول الله صلى الله عليه وسلم وجعل الكفار يحبسونهم ويعذبونهم بالضرب والجوع والعطش، فلما رأى رسول الله صلى الله عليه وسلم ذلك، وماهو فيه من العافية لمكانه من الله ومن عمه أبي طالب وأنه لايقدر على أن يمنعهم مماهم فيه من البلاء قال لهم: لو خرجتم الى أرض الحبشة فإن بها ملكاً لا يظلم عنده أحد وهي أرض صدق حتى يجعل لكم فرجاً مما أنتم فيه فخرج عند ذلك المسلمون من أصحاب رسول الله صلى الله عليه وسلم الى أرض الحبشة مخافة الفتنة وفراراً الى الله بدينهم فكانت أول هجرة كانت في الاسلام.';
const String p7 =
    'كانت قبائل العرب في تلك الفترة تدين بالولاء والطاعة لقريش وتسمع وتطيع لأمرها في الغالب، إذ لها نفوذ عليها وكانت القبائل في حاجة لقريش في حجها وتجارتها ومواسمها وفوق ذلك كانوا يشاركون قريش في حرب الدعوة وعدم الاستجابة للنبي صلى الله عليه وسلم.';
const String p8 =
    'التزم الأحباش بالنصرانية وهي أقرب إلى الإسلام من الوثنية، ولذلك فرح المؤمنون بانتصار النصارى على فارس المجوس المشركين في الفترة المكية سنة ثمان في البعثة كما في القرآن.';
const String p9 =
    'فلما رأت قريش أن أصحاب رسول الله صلى الله عليه وسلم قد آمنوا، واطمأنوا بأرض الحبشة وأنهم قد أصابوا بها داراً واستقراراً وحسن جوار من النجاشي وعبدوا الله لايؤذيهم أحد، ائتمروا فيما بينهم أن يبعثوا وفداً للنجاشي لإحضار من عنده من المسلمين إلى مكة.';
const String p10 =
    'فعن أم سلمة بنت أبي أمية المغيرة زوج النبي صلى الله عليه وسلم قالت: لما نزلنا أرض الحبشة جاورنا بها خير جار -النجاشي- أمنا على ديننا وعبدنا الله تعالى لانؤذي ولانسمع شيئاً نكرهه ، فلما بلغ ذلك قريشاً ائتمروا أن يبعثوا إلى النجاشي فينا رجلين وأن يهدوا للنجاشي هدايا، وكان من أعجب مايأتيه منها إليه الأدم -الجلد المدبوغ- ولم يتركوا من بطارقته -البطريق هو الحاذق بالحرب وأمورها بلغة الروم- بطريقاً إلا أهدوا له هدية، ثم بعثوا بذلك عبدالله بن أبي ربيعة بن المغيرة المخزومي وعمرو بن العاص بن وائل السهمي وأمروهما أمرهم وقالوا لهما: ادفعا إلى كل بطريق هديته قبل أن تكلموا النجاشي.';
const String p11 =
    'فقبل النجاشي هداياهم ثم كلماه فقالا: أيها الملك إنه قد صبأ إلى بلدك منا غلمان سفهاء فارقوا دين قومهم ولم يدخلوا في دينك وجاءوا بدين مبتدع لانعرفه نحن ولا أنت وقد بعثنا إليك فيهم أشراف قومهم من آباءهم وأعمامهم لتردهم إليهم فهم أعلى بهم عيناً وأعلم بما عابوا عليهم وعاتبوهم فيه.';
const String p12 =
    'قالت: فغضب النجاشي ثم قال: لا هايم الله إذا لا أسلمهم إليهما ولا أكاد، قوماً جاوروني ونزلوا بلادي واختاروني على من سواي حتى أدعوهم فأسألهم مايقول هذان في أمرهم؟ فإن كانوا كما يقولون أسلمتهم إليهما ورددتهم الى قومهم وإن كانوا على غير ذلك منعتهم منهما وأحسنت جوارهم ماجاوروني.';
const String p13 =
    'ثم أرسل النجاشي الى أصحاب رسول الله صلى الله عليه وسلم فدعاهم فلما جاءهم رسوله اجتمعوا ثم قال بعضهم لبعض ماتقولون للرجل إذا جئتموه؟ قالوا: نقول والله ماعلمنا وما أمرنا به نبينا صلى الله عليه وسلم كائناً في ذلك ماهو كائن فلما جاءه وقد دعا النجاشي أساقفته، فنشروا مصاحفهم حوله سألهم فقال: ماهذا الدين الذي فارقتم فيه قومكم ولم تدخلوا ديني ولا دين أحد من هذه الأمم؟';
const String p14 =
    'قالت فكان الذي كلمه جعفر بن أبي طالب رضي الله عنه فقال له: أيها الملك كنا قوماً أهل جاهلية نعبد الأصنام ونأكل الميتة ونأتي الفواحش ونقطع الأرحام ونسيء الجوار يأكل القوي منا الضعيف، فكنا على ذلك حتى بعث الله إلينا رسولاً نعرف نسبه وصدقه وأمانته وعفافه فدعانا الى الله لنوحده ونعبده ونخلع ماكنا نعبد وآباؤنا من دونه من الحجارة والأوثان وأمرنا بصدق الحديث وأداء الأمانة وصلة الرحم وحسن الجوار والكف عن المحارم والدماء ونهانا عن الفواحش وقول الزور وأكل مال اليتيم وقدف المحصنة، وأمرنا أن نعبد الله وحده لانشرك به شيئاً وأمرنا بالصلاة والزكاة والصيام.';
const String p15 =
    'قالت: فعدد عليه أمور الاسلام -فصدقناه- وآمنا به، واتبعناه على ماجاء به فعبدنا الله وحده فلم نشرك به شيئاً، وحرمنا ماحرم علينا، وأحللنا ما أحل لنا، فعدا علينا قومنا، فعذبونا وفتنونا عن ديننا ليردونا الى عبادة الأوثان من عبادة الله، وأن نستحل ماكنا نستحل من الخبائث فلما قهرونا وظلمونا وشقوا علينا، وحالوا بيننا وبين ديننا، خرجنا الى بلدك واخترناك على من سواك ورغبنا في جوارك ورجونا ألا نظلم عندك أيها الملك.';
const String p16 =
    'قالت: فقال له النجاشي: هل معك مما جاء به عن الله شيء؟ قال له جعفر: نعم، فقال له النجاشي: فاقرأه عليّ؟';
const String p17 =
    'فقرأ عليه صدراً من كهيعص قالت: فبكى والله النجاشي، حتى أخضل لحيته، وبكت أساقفته، حتى أخضلوا مصاحفهم حين سمعوا ماتلا عليهم.';
const String p18 =
    'ثم قال النجاشي: إن هذا والله والذي جاء به موسى ليخرج من مشكاة واحدة، انطلقا فوالله لا أسلمهم إليكم أبداً ولا أكاد';
const String p19 =
    'فلما خرج كل من عمرو بن العاص وعبد الله بن أبي ربيعة من عند النجاشي قال عمرو بن العاص: والذي لآنبئهم غداً عيبهم عندهم ثم أستأصل به خضراءهم - أي أقضي به على دهمائهم وسوادهم قالت: فقال له عبدالله بن أبي ربيعة وكان أتقى الرجلين فينا لا تفعل فإن لهم أرحاماً وإن كانوا قد خالفونا.';
const String p20 =
    'قال: والله لأخبرنه أنهم يزعمون أن عيسى بن مريم عبد قالت: ثم غدا عليه الغد فقال له: إيها الملك إنهم يقولون في عيسى بن مريم قولاً عظيماً فأرسل إليهم فاسألهم عما يقولون فيه قالت: فارسل إليهم يسألهم عنه قالت: ولم ينزل بنا مثله فاجتمع القوم فقال بعضهم لبعض ماذا تقولون في عيسى إذا سألكم عنه؟ قالوا: نقول والله فيه ماقال الله وماجاء به نبينا كائناً في ذلك ماهو كائن فلما دخلوا عليه قال لهم: ماتقولون في عيسى بن مريم؟';
const String p21 =
    'فقال له جعفر بن أبي طالب: نقول فيه الذي جاء به نبينا: هو عبدالله ورسوله وروحه وكلمته ألقاها الى مريم العذراء البتول.';
const String p22 =
    'قالت: فضرب النجاشي يده الى الأرض فأخذ منها عوداً ثم قال: ماعدا عيسى بن مريم ماقلت هذا العود، فتناخرت بطارقته - أي تكملت وكأنه كلام مع غضب، حوله حين قال ماقال فقال: وإن نخرتم والله، اذهبوا فأنتم شيوم بأرضي والشيوم الآمنون من يسبكم غَرِمَ ثم من سبكم غرم فما أحب أن لي دبراً ذهباً وإني آذيت رجلاً منكم والدبر بلسان الحبشة الجعل، ردوا عليهما هداياهما فلا حاجة لنا بها فوالله ما أخذ الله مني الرشوة حين رد عليّ ملكي فآخذ الرشوة فيه وما أطاع الناس في أطيعهم فيه، قالت: فخرجا من عنده مقبوحين مردوداً عليهما ماجاءا به، وأقمنا عنده بخير دار مع خير جار.';
const String p23 =
    'أسلم النجاشي وصدق بنبوة النبي صلى الله عليه وسلم وإن كان قد أخفى إيمانه عن قومه، لما علمه فيهم من الثبات على الباطل وحرصهم على الضلال، وجمودهم على العقائد المنحرفة وإن صادمت العقل والنقل، فعن أبي هريرة رضي الله عنه : أن رسول الله صلى الله عليه وسلم نعى النجاشي في اليوم الذي مات فيه، وخرج بهم الى المصلى، فصف بهم وكبر عليه أربع تكبيرات، وعن جابر رضي الله عنه قال: قال النبي صلى الله عليه وسلم حين مات النجاشي: مات اليوم رجل صالح فقوموا فصلوا على أخيكم أصحمة';
const String p24 =
    'رضي الله عنه وأرضاه وكانت وفاته رحمه الله سنة تسع عند الأكثر وقيل سنة ثمان قبل فتح مكة.';
const String p25 =
    'إن ثبات المؤمنين على عقيدتهم بعد أن ينزل بهم الأشرار والضالون أنواع العذاب والاضطهاد، دليل على صدق إيمانهم وإخلاصهم في معتقداتهم وسمو نفوسهم وأرواحهم بحيث يرون ماهم عليه من راحة الضمير واطمئنان النفس والعقل وما يأملونه من رضا الله جل شأنه أعظم بكثير مما ينال أجسادهم من تعذيب وحرمان واضطهاد، لأن السيطرة في المؤمنين الصادقين والدعاة المخلصين تكون دائماً وأبداً لأرواحهم لا لأجسادهم وهم يسرعون الى تلبية مطالب أرواحهم من حيث لايبالون بما تتطلبه أجسامهم من راحة وشبع ولذة، وبهذا تنتصر الدعوات وبهذا تتحرّر الجماهير من الظلمات والجهالات.';

const String t1 = 'الهجرة الى الحبشة';
const String t2 = 'أسباب الهجرة الى الحبشة';
const String t3 = 'أرض الحبشة';
const String t4 = 'سعي قريش في رد المهاجرين';
const String t5 = 'حوار جعفر والنجاشي';
const String t6 = 'عدل النجاشى';
const String t7 = 'إسلام النجاشي';
const String t8 = 'ثبات المؤمنين';

