const String p1 =
    'أرتكبت قريش خطأ فادحاً عندما أعانت حلفاءها بني بكر على خزاعة حليفة المسلمين بالخيل والسلاح والرجال وهاجم بنو بكر، وحلفاؤهم على قبيلة خزاعة عند ماء يقال له الوتير، وقتلوا أكثر من عشرين من رجالها، ولما لجأت خزاعة الى الحرم الآمن ولم تكن متجهزة للقتال لتمنع بني بكر منه، قالت لقائدهم: يانوفل إنا قد دخلنا الحرم إلهك فقال نوفل: لا إله اليوم يابني بكر أصيبوا ثأركم عندئذ خرج عمرو بن سالم الخزاعي في أربعين من خزاعة، حتى قدموا على رسول الله صلى الله عليه وسلم في المدينة، وأخبروه بما كان من بني بكر، وبمن أصيب منهم، وبمناصرة قريش بني بكر عليهم، وانطلق عمرو بن سالم إلى رسول الله صلى الله عليه وسلم فى المدينة وكان جالس في المسجد بين ظهراني الناس وقال:';
const String p2 = 'يارب إني ناشد محمداً .. حِلف أبينا وأبيه الأتلدا';
const String p3 = 'قد كنتم وُلدا وكنا والداً .. تُمت أسلمنا فلم ننزع يدا';
const String p4 = 'إن قريشاً أخلفوك الموعدا .. ونقضوا ميثاقك المؤكدا';
const String p5 = 'هم بيتونا بالوتير هجّدا .. وقتلونا ركَّعا وسجدا';
const String p6 = 'فانصر هداك الله نصراً أعتدا .. وادع عباد الله يأتوا مدداً';
const String p7 = 'فقال النبي صلى الله عليه وسلم: نُصرتَ ياعمرو بن سالم';
const String p8 =
    'بعثت قريش أبا سفيان الى المدينة لتمكين الصلح وإطالة أمده وعندما وصل الى المدينة ودخل على رسول الله صلى الله عليه وسلم يعرض حاجته، أعرض عنه النبي صلى الله عليه وسلم ولم يجبه، فاستعان بكبار الصحابة أمثال أبي بكر وعمر وعثمان وعلي حتى يتوسطوا بينه وبين رسول الله، فابوا جميعاً ، فعاد أبو سفيان الى مكة من غير أن يحظي بأي اتفاق أو عهد، ومما يذكر عند نزوله في المدينة دخل على ابنته أم حبيبة -أم المؤمنين- وأراد أن يجلس على فراش رسول الله طوته عنه؛ فقال: يابنية ماأدري، أرغبت بي عن هذا الفراش، أم رغبت به عني؟ قالت: بل هذا فراش رسول الله وأنت مشرك نجس، قال: والله لقد أصابك بعدي شر.';
const String p9 =
    'وهذا الموقف لا يستغرب من أم حبيبة، فهي ممن هاجر الهجرتين وقد قطعت صِلاتها بالجاهلية منذ أمد بعيد، إنها لم تر أباها منذ ستة عشر سنة، فلما رأته لم تر فيه الوالد الذي ينبغي أن يُقدر ويُحترم.';
const String p10 =
    'أخذ النبي صلى الله عليه وسلم بمبدأ السرية المطلقة والكتمان الشديد حتى عن أقرب الناس إليه وهو أبوبكر رضي الله عنه أقرب أصحابه الى نفسه وحتى زوجته عائشة رضي الله عنها.';
const String p11 =
    'بث صلى الله عليه وسلم رجال استخبارات الدولة الاسلامية داخل المدينة وخارجها حتى لا تنتقل أخباره الى قريش: وأخذ رسول الله صلى الله عليه وسلم بالأنقاب، فكان عمر بن الخطاب رضي الله عنه يطوف على الأنقاب قيماً بهم فيقول: لا تدعوا أحداً يمر بكم تنكرونه إلا رددتموه إلا من سلك الى مكة فإنه يتحفظ به ويسأل عنه أو ناحية مكة.';
const String p12 =
    'عندما أكمل النبي صلى الله عليه وسلم استعداده للسير الى فتح مكة، كتب حاطب بن أبي بلتعة كتاباً الى أهل مكة يخبرهم فيه نبأ تحرك النبي صلى الله عليه وسلم إليهم، ولكن الله سبحانه وتعالى أطلع نبيه صلى الله عليه وسلم عن طريق الوحي على هذه الرسالة، فقضى صلى الله عليه وسلم على هذه المحاولة وهي في مهدها، فأرسل النبي صلى الله عليه وسلم علياً والمقداد فأمسكوا بالمرأة في روضة خاخ على بعد اثنى عشر ميلاً من المدينة، وهددوها أن يفتشوها إن لم تخرج الكتاب فسلمته لهم ثم استدعي حاطب رضي الله عنه للتحقيق فقال: يارسول الله، لا تعجل عليّ إني كنت امرأ ملصقاً في قريش يقول: كنت حليفاً ولم أكن من أنفسها، وكان من معك من المهاجرين من لهم قرابات يحمون بها أهليهم وأموالهم، فأحببت إذ فاتني ذلك من النسب فيهم أن أتخذ عندهم يداً يحمون قرابتي، ولم أفعله ارتداداً عن ديني ولا رضاً بالكفر بعد الاسلام، فقال رسول الله صلى الله عليه وسلم: إما إنه قد صدقكم.';
const String p13 =
    'فقال عمر: يارسول الله دعني أضرب عنق هذا المنافق، فقال صلى الله عليه وسلم: إنه قد شهد بدراً ومايدريك لعل الله اطلع على من شهد بدراً فقال: اعملوا ماشئتم فقد غفرت لكم، فأنزل الله تعالى: يَاأَيُّهَا الَّذِينَ ءَامَنُوا لا تَتَّخِذُوا عَدُوِّي وَعَدُوَّكُمْ أَوْلِيَاءَ تُلْقُونَ إِلَيْهِمْ بِالْمَوَدَّةِ وَقَدْ كَفَرُوا بِمَا جَاءَكُمْ مِنَ الْحَقِّ يُخْرِجُونَ الرَّسُولَ وَإِيَّاكُمْ أَنْ تُؤْمِنُوا بِاللَّهِ رَبِّكُمْ إِنْ كُنْتُمْ خَرَجْتُمْ جِهَادًا فِي سَبِيلِي وَابْتِغَاءَ مَرْضَاتِي تُسِرُّونَ إِلَيْهِمْ بِالْمَوَدَّةِ وَأَنَا أَعْلَمُ بِمَا أَخْفَيْتُمْ وَمَا أَعْلَنْتُمْ وَمَنْ يَفْعَلْهُ مِنْكُمْ فَقَدْ ضَلَّ سَوَاءَ السَّبِيلِ - سورة الممتحنة ، وإن الآية السابقة رسمت منهجاً للمسلمين في تعاملهم مع الكافرين.';

const String p14 =
    'خرج رسول الله صلى الله عليه وسلم قاصداً مكة في العاشر من رمضان من العام الثامن للهجرة، فلما وصل الجيش الكديد الماء الذي بين قديد وعُسفان أفطر رسول الله صلى الله عليه وسلم وأفطر الناس معه ، وفي الجحفة لقيه العباس بن عبدالمطلب عمه وقد خرج مهاجراً بعياله، فسُرَّ صلى الله عليه وسلم، وفي خروج العباس بأهله وأولاده من مكة وكان بها بمثابة المراسل العسكري أو مدير الاستخبارات هناك يشير الى أن مهمته فيها قد انتهت، وخاصة، إذا لاحظنا أن بقاءه في مكة كان بأمر الرسول صلى الله عليه وسلم.';
const String p15 =
    'وتابع رسول الله صلى الله عليه وسلم سيره حتى أتى مر الظهران، فنزل فيه عشاء، فأمر الجيش فأوقدوا النيران فأوقدت عشرة آلاف نار وجعل رسول الله على الحرس عمر بن الخطاب.';
const String p16 =
    'ودخلت قوات المسلمين مكة من جهاتها الأربعة في آن واحد ولم تلق تلك القوات مقاومة وكان في دخول جيش المسلمين من الجهات الأربعة ضربة قاضية لفلول المشركين حيث عجزت عن التجمع وضاعت منها فرصة المقاومة،ودخل ابو سفيان الى مكة مسرعاً ونادى بأعلى صوته: يامعشر قريش هذا محمد جاءكم فيما لاقبل لكم به فمن دخل دار أبي سفيان فهو آمن.';
const String p17 =
    'ولما نزل رسول الله صلى الله عليه وسلم بمكة وأطمأن الناس خرج حتى جاء البيت فطاف به وفي يده قوس، وحول البيت وعليه ثلاثمائة وستون صنماً فجعل يطعنها بالقوس، ويقول: جاء الحق وزهق الباطل إن الباطل كان زهوقا جاء الحق، ومايبدئ الباطل ومايعيد والأصنام تتساقط على وجوهها، وإنه لمظهر رائع لنصر الله وعظيم تأييده لرسوله، إذ كان يطعن تلك الآلهة الزائفة المنثورة حول الكعبة بعصا معه، فما يكاد يطعن الواحد منها بعصاه حتى ينكفئ على وجهه أو ينقلب على ظهره جذاذاً ورأى في الكعبة الصور والتماثيل، فأمر بالصور وبالتماثيل فكسرت، وأبى أن يدخل جوف الكعبة حتى أخرجت الصور وكان فيها صورة يزعمون أنها صورة إبراهيم وإسماعيل وفي يديهما من الأزلام فقال النبي صلى الله عليه وسلم : قاتلهم الله لقد علموا ما استقسما بها قط.';
const String p18 =
    'ثم دخل البيت وكبر في نواحيه ثم صلى فقد روى ابن عمر أن رسول الله صلى الله عليه وسلم دخل الكعبة هو وأسامة وبلال وعثمان بن طلحة، فأغلقها عليه ثم مكث فيها قال ابن عمر: فسألت بلالاً حين خرج ماصنع رسول الله؟ قال : جعل عمودين عن يساره وعموداً عن يمينه وثلاثة أعمدة وراءه وكان البيت يومئذ على ستة أعمدة ثم صلى.';
const String p19 =
    'وكان مفتاح الكعبة مع عثمان بن طلحة قبل أن يسلم فأراد علي رضي الله عنه أن يكون المفتاح له مع السقاية لكن النبي صلى الله عليه وسلم دفعه الى عثمان بعد أن خرج من الكعبة ورده إليه قائلاً: اليوم يوم بر ووفاء، وكان صلى الله عليه وسلم قد طلب من عثمان بن طلحة المفتاح قبل أن يهاجر الى المدينة، فأغلظ له القول ونال منه فحلم عنه، وقال ياعثمان لعلك ترى هذا المفتاح يوماً بيدي أضعه حيث شئت، فقال لقد هلكت قريش يومئذ وذلت فقال: بل عمرت وعزت يومئذ، ووقعت كلمته من عثمان بن طلحة موقعاً، وظن أن الأمر سيصير الى ماقال، ولقد أعطى رسول الله صلى الله عليه وسلم مفاتيح الكعبة قائلاً له: هاك مفتاحك ياعثمان اليوم يوم بر ووفاء، خذوها خالدة تالدة لاينزعها منكم إلا ظالم.';
const String p20 =
    'نال أهل مكة عفواً عاماً رغم أنواع الأذى التي ألحقوها بالرسول صلى الله عليه وسلم ودعوته، ورغم قدرة الجيش الاسلامي على إبادتهم وقد جاء إعلان العفو عنهم وهم مجتمعون قرب الكعبة ينتظرون حكم الرسول صلى الله عليه وسلم فيهم فقال: ماتظنون أني فاعل بكم؟ فقالوا: خيراً أخ كريم وابن أخ كريم فقال: لا تثريب عليكم اليوم يغفر الله لكم.';
const String p21 =
    'ولما فرغ رسول الله صلى الله عليه وسلم من بيعة الرجال، بايع النساء وفيهن هند بنت عتبة متنقبة متنكرة، على أن لايشركن بالله شيئاً ولا يسرقن ولا يزنين ولا يقتلن أولادهن ولا يأتين ببهتان يفترينه بين أيديهن وأرجلهن ولا يعصين في معروف، ولما قال النبي: ولا يسرقن قالت هند: يارسول الله إن أبا سفيان رجل شحيح لا يعطيني مايكفيني ويكفي بنيَّ، فهل عليّ من حرج إذا أخذت من ماله بغير علمه؟ فقال لها صلى الله عليه وسلم : خذي من ماله مايكفيك وبنيك بالمعروف، ولما قال: ولا يزنين قالت هند: وهل تزني الحرة؟ ولما عرفها رسول الله قال لها: وإنك لهند بنت عتبة؟ قالت: نعم فاعف عما سلف عفا الله عنك.';
const String p22 =
    'وقد بايعن رسول الله صلى الله عليه وسلم من غير مصافحة، فقد كان لايصافح النساء ولا يمس يد أمرأة إلا امرأة أحلها الله له أو ذات محرم منه، وفي الصحيحين عن عائشة رضي الله عنها أنها قالت: لا والله مامست يد رسول الله يد امرأة قد وفي رواية: ماكان يبايعهن إلا كلاماً ويقول: إنما قولي لامرأة واحدة كقولي لمائة امرأة.';
const String p23 =
    'أراد فضالة بن عمير بن الملوح الليثي قتل النبي صلى الله عليه وسلم وهو يطوف بالبيت عام الفتح، فلما دنا منه قال رسول الله صلى الله عليه وسلم : أفضالة؟ قال: نعم فضالة يارسول الله قال: ماذا كنت تحدث به نفسك؟ قال: لاشيء كنت أذكر الله، قال: فضحك النبي صلى الله عليه وسلم، ثم قال: استغفر الله ثم وضع يده على صدره فسكن قلبه، فكان فضالة يقول: والله مارفع يده عن صدري حتى مامنْ خلق الله شيء أحبُّ إلى منه.';
const String p24 =
    'جواز الصوم والفطر في شهر رمضان للمسافر في غير معصية حيث صام الرسول في مسيرة الجيش من المدينة حتى بلغ كديدا فأفطر.';
const String p25 =
    'صلى النبي صلى الله عليه وسلم صلاة الضحى ثمان ركعات خفيفة واستدل قوم بهذا على أنها سنّة مؤكدة.';
const String p26 =
    'قصر الصلاة الرباعية للمسافر، فقد اقام النبي بمكة تسعة عشر يوماً يقصر الصلاة.';
const String p27 =
    'تحريم نكاح المتعة الى الأبد، كما اوصى عدم جواز الوصية بأكثر من ثلث المال، كما في قصة سعد بن أبي وقاص حين مرضه بمكة واستشارة الرسول صلى الله عليه وسلم في أن يوصي بأكثر من الثلث.';
const String p28 =
    'لقد تحقق وعد الله بالتمكين للمؤمنين الصادقين بعد ماضحوا بالغالي والنفيس وحققوا شروط التمكين وأخذوا بأسبابه وقطعوا مرحلة وتعاملوا مع سننه كسنّة الابتلاء والتدافع والتدرج وتغيير النفوس والأخذ بالأسباب ولا ننسى تلك الصورة الرائعة وهي وقوف بلال فوق الكعبة مؤذناً للصلاة بعد أن عذب في بطحاء مكة وهو يردد أحد أحد في أغلاله وحديده هاهو اليوم قد صعد فوق الكعبة ويرفع صوته الجميل بالآذان وهو في نشوة الإيمان.';

const String t1 = 'أعانت قريش حلفاءها بني بكر على خزاعة';
const String t2 = 'ابو سفيان يحاول تلافي حماقة قريش';
const String t3 = 'كتم أمر الخروج لمكة';
const String t4 = 'بعث العيون لمنع وصول المعلومات الى الأعداء';
const String t5 = 'أحباط محاولة تجسس حاطب بن أبى بلتعة';
const String t6 = 'الشروع في الخروج';
const String t7 = 'النزول بمر الظهران';
const String t8 = 'دخول المسلمون مكة';
const String t9 = 'قل جاء الحق وزهق الباطل';
const String t10 = 'مفتاح الكعبة وعثمان بن طلحة';
const String t11 = 'إعلان العفو العام';
const String t12 = 'مبايعة النساء وهند بنت عتبة';
const String t13 = 'من عفو النبي صلى الله عليه وسلم وحلمه';
const String t14 = 'من الأحكام الشرعية التي تؤخذ من الغزوة';
const String t15 = 'التمكين للمؤمنين';
